docs: rewrite README
